; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-3-5-3-8-8-3) (:domain depots)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 distributor3 distributor4 - Distributor
	truck0 truck1 truck2 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 - Pallet
	crate0 crate1 crate2 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 distributor3)
	(clear crate1)
	(at pallet7 distributor4)
	(clear crate2)
	(at truck0 distributor3)
	(at truck1 distributor1)
	(at truck2 depot0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor3)
	(available hoist6)
	(at hoist7 distributor4)
	(available hoist7)
	(at crate0 distributor3)
	(on crate0 pallet6)
	(at crate1 distributor3)
	(on crate1 crate0)
	(at crate2 distributor4)
	(on crate2 pallet7)
)

(:goal (and
		(on crate0 pallet6)
		(on crate1 pallet7)
		(on crate2 pallet3)
	)
))

; plan
1. (lift hoist6 crate1 crate0 distributor3)
   deleted: (at crate1 distributor3) (available hoist6) (on crate1 crate0) (clear crate1)
   added: (lifting hoist6 crate1) (clear crate0)
   goals met: 1 of 3
2. (load hoist6 crate1 truck0 distributor3)
   deleted: (lifting hoist6 crate1)
   added: (in crate1 truck0) (available hoist6)
   goals met: 1 of 3
3. (lift hoist7 crate2 pallet7 distributor4)
   deleted: (at crate2 distributor4) (available hoist7) (on crate2 pallet7) (clear crate2)
   added: (lifting hoist7 crate2) (clear pallet7)
   goals met: 1 of 3
4. (drive truck0 distributor3 distributor4)
   deleted: (at truck0 distributor3)
   added: (at truck0 distributor4)
   goals met: 1 of 3
5. (load hoist7 crate2 truck0 distributor4)
   deleted: (lifting hoist7 crate2)
   added: (in crate2 truck0) (available hoist7)
   goals met: 1 of 3
6. (unload hoist7 crate1 truck0 distributor4)
   deleted: (available hoist7) (in crate1 truck0)
   added: (lifting hoist7 crate1)
   goals met: 1 of 3
7. (drive truck0 distributor4 distributor0)
   deleted: (at truck0 distributor4)
   added: (at truck0 distributor0)
   goals met: 1 of 3
8. (drop hoist7 crate1 pallet7 distributor4)
   deleted: (lifting hoist7 crate1) (clear pallet7)
   added: (at crate1 distributor4) (available hoist7) (on crate1 pallet7) (clear crate1)
   goals met: 2 of 3
9. (unload hoist3 crate2 truck0 distributor0)
   deleted: (available hoist3) (in crate2 truck0)
   added: (lifting hoist3 crate2)
   goals met: 2 of 3
10. (drop hoist3 crate2 pallet3 distributor0)
   deleted: (lifting hoist3 crate2) (clear pallet3)
   added: (at crate2 distributor0) (available hoist3) (on crate2 pallet3) (clear crate2)
   goals met: 3 of 3
